{"data":{"site":{"siteMetadata":{"title":"I wrote this","author":"Geoff Ford"}},"markdownRemark":{"id":"2df7d46a-457f-5386-81d6-8f1cbb8a03a5","excerpt":"The terms API and microservice often get interchanged and mixed in a conversation, however there are some significant differences in the…","html":"<p>The terms API and microservice often get interchanged and mixed in a conversation, however there are some significant differences in the terms.</p>\n<h1>APIs</h1>\n<p>AN API is a collection of actions that can be performed on a dataset.  Most often this will be exposed as a ReSTful style i.e. HTTP verbs on a resource, although alternatives such as GraphQL are becoming increasingly popular.</p>\n<p>The advantages of a ReSTful API is that it is generally consistent set of actions and therefore quite simple for an application developer to ‘guess’ what the correct usage of the API is. There is common set of principles and each technology has a generally accepted approach to implementing them.\nMicroservice</p>\n<p>From Wikipedia</p>\n<blockquote>\n<p>“a software development technique—a variant of the service-oriented architecture (SOA) architectural style that structures an application as a collection of loosely coupled services. In a microservices architecture, services are fine-grained and the protocols are lightweight.M”</p>\n</blockquote>\n<p>The key phrase in this description is loosely coupled.  This enables a number of key features:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">more conscious design is put into the data model and context boundaries, providing better domain models and preventing &quot;big-ball-of-mud&quot; designs from accidentally occurring\nreduced risk e.g. a change in one service does not affect the entire application, conversely a delay in one service does not stall the entire application\ncomplexity of individual services is reduced allowing development to be faster, especially for new starters</code></pre></div>\n<p>However, whilst individual services may be reduced in complexity and allow faster evolution and deployment, the additional operational overhead of the integration of components and monitoring and debugging of a distributed system is something that needs to be considered.\nThe difference</p>\n<p>An API is a contract on how to use a service. A microservice is an architectural design pattern that separates applications into multiple physical components.</p>\n<p>A traditional monolithic application can expose an API (or several) and a microservice will usually expose an API.  However the difference is highlighted in the way inter-service communication is conducted.  In a traditional monolithic applications, services and domains will directly interact at the code and data level, tying them together.  In a microservice architecture communication is through contracts, using generic data interchange formats allowing the services to evolve and/or be replaced without affecting each other.\nConclusion</p>\n<p>A microservice is an architectural pattern that will often expose an API as part of the service.  There are many more advantages to microservices than just having a API however the operational overhead and complexity is something that needs to be considered.</p>","fields":{"readingTime":{"text":"3 min read"}},"frontmatter":{"title":"APIs vs Microservices","date":"June 03, 2019","tags":["aws","security"]}}},"pageContext":{"slug":"/api-vs-microservice/","previous":{"fields":{"slug":"/encryption-at-rest-aws/"},"frontmatter":{"title":"How to: Encrypt at Rest on AWS"}},"next":null}}