{"data":{"site":{"siteMetadata":{"title":"I wrote this","author":"Geoff Ford"}},"markdownRemark":{"id":"5c026b19-2325-5ea0-81e8-aa2eac090511","excerpt":"In addition to the relevant government and industry regulations and standards, most organisations will have a policy that cover encryption…","html":"<p>In addition to the relevant government and industry regulations and standards, most organisations will have a policy that cover encryption at rest such as as a Data Secuirty Policy or a Cloud Security Policy. The general consensus of these is that encryption at rest should be enable on anything that is classified as “Restricted” however, I personally think that encryption at rest should be enabled on all systems in AWS regardless of the data classification so that we are comfortable with the process at all levels.</p>\n<h1>Why is Encryption at Rest Important?</h1>\n<p>In today’s security climate it is good practice to enable encryption on everything whether the data is in motion (HTTPS/SSL) or when it is at rest sitting on a disk.  There are many techniques to protect data at rest ranging from physical security, intrusion detection and file integrity, anti-virus through to encryption.</p>\n<p>With Cloud Services encryption is what we have the most control over.</p>\n<h1>Self managed vs AWS managed keys</h1>\n<p>In the majority of services there are two options for managing the encryption keys.</p>\n<h2>AWS managed</h2>\n<p>For most teams and applications AWS managed keys is the simplest and easiest options.  AWS will auto generate a key for each service in each region and use these when enabling encryption.  This service specific key is generated and encrypted using the the Customer Master Key. AWS will also mange the lifecycle of the generated service specific key.</p>\n<h2>Self managed</h2>\n<p>A number of services allow you to specify an alternative key to the default one e.g. when uploading an item to an S3 bucket you can specify <code class=\"language-text\">--sse aws:kms --sse-kms-key-id &lt;key-id&gt;</code> which will encrypt the object with a specific key.</p>\n<p>Self managed keys are great for when you want additional control over the management of the key and its life cycle or alternatively when needing to create even more secure of segregated data e.g. using a client specific key for storing s3 objects.</p>\n<h1>Enabling Encryption on Rest on AWS Services</h1>\n<h2>RDS</h2>\n<p>Enabling encryption on RDS is a simple flag for all engines.  When creating your RDS instances you needs to specify the StorageEncrypted parameter.</p>\n<p>Retrofitting and existing RDS instance with encryption is a little more involved as you cannot set the StorageEncrypted parameter after creation.</p>\n<ol>\n<li>Take a snapshot of the RDS instance</li>\n<li>Copy and encrypt the snapshot</li>\n<li>Create a new RDS instance from the snapshot, which will now be encrypted</li>\n<li>Clean up the old instance</li>\n</ol>\n<p>Cloud Conformity have an excellent write up on <a href=\"https://www.cloudconformity.com/conformity-rules/RDS/rds-encryption-enabled.html\">enabling encryption on an existing RDS instance</a> using the console or CLI.</p>\n<p>All infrastructure code and automation should also be updated to enable the setting when creating environments.</p>\n<h2>DynamoDB</h2>\n<p>DynamoDB has encryption at rest enabled by default using AWS managed keys. You can read more about encryption in DynamoDB on the <a href=\"https://docs.amazonaws.cn/en_us/amazondynamodb/latest/developerguide/encryption.usagenotes.html\">AWS Documentation</a>.</p>\n<h2>S3</h2>\n<p>S3 buckets can be encrypted after creation using the <code class=\"language-text\">put-bucket-encryption</code> command. See <a href=\"https://www.cloudconformity.com/conformity-rules/S3/bucket-default-encryption.html\">Cloud Conformity’s resolution guide</a> on how to do this.  One thing to note is that this will not encrypt existing objects in the bucket.  You will need manually encrypt all existing objects which can be done with a recursive copy into the same bucket.</p>\n<p><code class=\"language-text\">aws s3 cp s3://bucket-name/prefix-a/ s3://bucket-name/prefix-a/  --recursive  --sse AES256</code></p>\n<p>Cloudformation Example</p>\n<div class=\"gatsby-highlight\" data-language=\"yaml\"><pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token key atrule\">SomeS3Bucket</span><span class=\"token punctuation\">:</span>\n    <span class=\"token key atrule\">Type</span><span class=\"token punctuation\">:</span> AWS<span class=\"token punctuation\">:</span><span class=\"token punctuation\">:</span>S3<span class=\"token punctuation\">:</span><span class=\"token punctuation\">:</span>Bucket\n    <span class=\"token key atrule\">Properties</span><span class=\"token punctuation\">:</span>\n      <span class=\"token key atrule\">BucketName</span><span class=\"token punctuation\">:</span> SomeS3Bucket\n      <span class=\"token key atrule\">BucketEncryption</span><span class=\"token punctuation\">:</span>\n        <span class=\"token key atrule\">ServerSideEncryptionConfiguration</span><span class=\"token punctuation\">:</span>\n        <span class=\"token punctuation\">-</span> <span class=\"token key atrule\">ServerSideEncryptionByDefault</span><span class=\"token punctuation\">:</span>\n            <span class=\"token key atrule\">SSEAlgorithm</span><span class=\"token punctuation\">:</span> AES256</code></pre></div>\n<h2>EC2</h2>\n<p>Similar to RDS, encryption can only be specified when an EBS volume is created by setting the Encrypted flag.</p>\n<p>Encrypting volumes that were not encrypted at creation requires a multi-step process.</p>\n<ol>\n<li>Take a snapshot of the volume</li>\n<li>Copy the snapshot with encryption</li>\n<li>Create a new volume from the snapshot</li>\n<li>Detach the unencrypted volume from the EC2 instance and attach the new encrypted volume.</li>\n</ol>\n<p>You can do this <a href=\"https://www.cloudconformity.com/conformity-rules/EBS/ebs-encrypted.html\">manually</a> or there are a <a href=\"https://github.com/jbrt/ec2cryptomatic\">couple</a> of <a href=\"https://github.com/conradf7/ebs-encrypt\">tools</a> to step through the process for you.</p>\n<h3>Root Volumes</h3>\n<p>Encrypting root volumes on existing instances is the same process as above. However creating new instances with encrypted root volumes is more involved.</p>\n<h4>Option 1: Never save data to the root volume</h4>\n<p>This is a viable option for many applications especially as more and more applications and services are being specifically designed around this.</p>\n<p>However this option may not be acceptable for older applications or vendor applications where you have less control of where and what data is written. For example Windows application may be storing sensitive information in the Registry or writing events to the Windows Event Log which may end up on C drive. Vendor applications may writing logs or caches to disk in locations that you cannot control.</p>\n<h4>Option 2: Create an AMI with encrypted root volume</h4>\n<p>Where you cannot avoid writing to the root volume, or if you just want the extra assurance, you can create and manage your own <a href=\"https://aws.amazon.com/blogs/security/how-to-create-a-custom-ami-with-encrypted-amazon-ebs-snapshots-and-share-it-with-other-accounts-and-regions/\">AMI with encrypted snapshots</a>. This is a significantly more involved process as you will now need to ensure that the AMI is properly managed including patching and OS updates, providing cross account access for Non-Prod and Prod accounts etc.</p>\n<h4>Option 3: Go Serverless</h4>\n<p>Where viable you can redesign or architect the servers out of the application using serverless architecture using any of the AWS managed infrastructure services e.g Lambda, Fargate etc.  For new services this should be considered but will likely not be desirable for “lift and shift” style applications where the architecture is moved onto the cloud as-is.</p>\n<p>There is no “right” answer here and it will depend on the level of maturity that the application team has in Cloud as well as the discipline they have when developing and enhancing the application to avoid accidentally circumventing option 1.</p>\n<h2>SNS</h2>\n<p>Adding encryption to an exiting SNS topic can only be done <a href=\"https://www.cloudconformity.com/conformity-rules/SNS/server-side-encryption.html\">using the Web Console</a> at the moment.</p>\n<p>You can enable it on new topics by setting the <code class=\"language-text\">KmsMasterKeyId</code> when creating the resource. It is recommended that you use the default <code class=\"language-text\">alias/aws/sns</code> key.</p>\n<h2>Other Services</h2>\n<p>The above are the most common services for storing data. There are some others that are:</p>\n<ul>\n<li>not in great use at the moment e.g. RedShift</li>\n<li>a combination of services e.g. Beanstalk</li>\n<li>not intended for data storage</li>\n</ul>\n<p>Whilst I have not covered every services options you should consider how you can enable encryption at rest for any and all services that you use on AWS.</p>","fields":{"readingTime":{"text":"6 min read"}},"frontmatter":{"title":"How to: Encrypt at Rest on AWS","date":"April 26, 2019","tags":["aws","security"]}}},"pageContext":{"slug":"/encryption-at-rest-aws/","previous":{"fields":{"slug":"/api-strategy/"},"frontmatter":{"title":"Getting an API strategy of the ground"}},"next":null}}